[
{
"id": 1,
"title": "第一签",
"type": "上上签",
"poem": "开天辟地作良缘，吉日良时万物全。\n若得此签非小可，人行忠正帝王宣。",
"interpretation": "朋友，恭喜你！这可是吕祖爷送来的头彩好签！它说的是一个全新的、美好的开始，就像天地初开一样，万事万物都处在最圆满、最和谐的状态。这可不是一般的运气，它是在告诉你，你之前的为人处世，那份真诚和正直，都被老天爷看在眼里啦。现在正是你发光发亮的时候，继续保持这份本心，更大的认可和机遇就在前方等着你。",
"advice": "乘着这股好势头，大胆地去推进你手头的重要事情吧！无论是工作上的新计划，还是生活中的新目标，现在都是启动的最佳时机。记住，你的真诚和正直是你最大的资本，保持下去，好运自然会持续相伴。"
},
{
"id": 2,
"title": "第二签",
"type": "上上签",
"poem": "鲸鱼未变守江湖，未许升腾离碧波。\n异日峥嵘身变态，从教一跃禹门过。",
"interpretation": "朋友，这支签描绘了一幅潜龙在渊、即将腾飞的画面。现在的你，就像那条还在江湖中积蓄力量的鲸鱼，时机未到，暂且不必急于跃出水面。这可不是说你不行，恰恰相反，吕祖爷看到了你体内蕴含的巨大潜力和不凡的本质，提醒你此刻正是夯实基础、耐心成长的黄金时期。别焦虑，你的‘峥嵘’时刻一定会到来。",
"advice": "把焦点放在自我提升和积累上。多学习，多观察，沉下心来打磨你的技能。当时机成熟，你积累的所有能量都会爆发出来，助你轻松越过‘龙门’，实现质的飞跃。现在要做的，就是相信时间的力量。"
},
{"id": 3, "title": "第三签", "type": "中平签", "poem": "衣食自然生处有，劝君不必苦劳心。\n但能孝悌存忠信，福禄来成祸不侵。", "interpretation": "朋友，这支签是在宽你的心呢！吕祖爷想告诉你，人生基本的福报就像大自然的馈赠，该有的时候自然会有，不必过于焦虑和拼命强求。他看到了你的辛苦，但更希望你能把心力放在更根本的事情上——那就是对家人的孝顺、对朋友的友爱，以及做人保持那份真诚和信用。这些看似平常的品德，才是守护你一生安稳、吸引福气的最强屏障。", "advice": "试着调整一下心态，把‘必须得到什么’的急切，换成‘做好眼前人、眼前事’的从容。多关心家人，真诚对待身边人，守住你的信誉。当你把这些根基打牢了，你会发现，福气和好运反而会不请自来，麻烦事也会远离你。"},
{"id": 4, "title": "第四签", "type": "上上签", "poem": "千年古镜复重圆，女再求夫男再婚。\n自此门庭重改换，更添福禄共儿孙。", "interpretation": "朋友，这可是支寓意破镜重圆、万象更新的上上签！吕祖爷告诉你，一段曾经失落或停滞的美好关系（可能是感情，也可能是合作）即将迎来修复和新生，就像千年古镜恢复完整。无论是情感还是家运，都将进入一个崭新的、更加和谐的阶段，福气不仅会回归，还会加倍地泽被后人。", "advice": "如果心中还有未了的缘分或期待合作的对象，现在是可以主动尝试重新联系的好时机。以开放和真诚的心去迎接生活中的新变化，特别是人际关系上的积极转变。你的家庭将因此充满新的活力与福气。"},
{"id": 5, "title": "第五签", "type": "中平签", "poem": "子有三般不自由，门庭萧索冷如秋。\n若逢牛鼠交承日，万事回春不用忧。", "interpretation": "朋友，抽到这支签，吕祖爷深知你最近可能感到有些束缚，手脚放不开，周围的环境也显得有些冷清，让你提不起劲。但这只是暂时的‘秋冬’季节，他明确地指出了一个转折点——当牛年鼠月交替的时机来临（或泛指某个特定时机），你的境遇就会像春天一样，万物复苏，所有烦忧都将烟消云散。", "advice": "目前的些许不顺只是过渡期，请保持耐心。可以利用这段相对‘清冷’的时间来沉淀自己，整理思路。密切关注时机的变化，特别是在年底或生肖轮转的节点附近，好运自会到来，让你的生活重新焕发生机。"},
{"id": 6, "title": "第六签", "type": "上上签", "poem": "投身岩下铜乌居，须是还他大丈夫。\n舍得寒宫白玉桂枝，一朝步入青云路。", "interpretation": "朋友，这是支先苦后甜、终成大业的上上签！吕祖爷用凤凰涅槃的故事来比喻你当前的处境。你可能正经历一段类似‘栖息在岩石下’的艰难岁月，但这正是考验你能否成为真正‘大丈夫’的关键时刻。只要你能咬牙坚持，舍得付出努力（如同取得月宫中珍贵的桂枝），那么终有一日，你将直上青云，成就非凡。", "advice": "眼前的困难是成就你卓越的阶梯。不要畏惧暂时的艰苦环境，更要勇于舍弃一时的安逸，去追求那个更高的目标。全力投入，持续精进，你付出的每一分努力，都在为你铺就那条通往成功的‘青云路’。"},
{"id": 7, "title": "第七签", "type": "中平签", "poem": "奔波阻隔重重险，带水拖泥去度山。\n更望他乡求用事，千山万水未回还。", "interpretation": "朋友，这支签反映出你目前可能正为某事奔波劳碌，过程阻碍重重，感觉步履维艰，就像拖着湿泥跋山涉水。吕祖爷看到了你的辛苦，但他也想提醒你，如果一味将希望寄托于远方或他人，可能反而会陷入更深的奔波，难以达到预期目标。这是在提示你，或许该调整一下努力的方向和方式了。", "advice": "是时候停下来审视一下当前的计划了。与其盲目地向外寻求突破，不如先稳住阵脚，看看身边是否有被忽略的机会或资源。优化办事方法，减少不必要的周折，有时‘向内求’比‘向外奔’更能有效地解决问题。"},
{"id": 8, "title": "第八签", "type": "上上签", "poem": "禾稻看看结成完，此事必定两相全。\n回到家中宽心坐，妻儿鼓舞乐团圆。", "interpretation": "朋友，大好消息！这支签预示着你长期努力的事情即将圆满成功，就像地里的庄稼眼看着就要丰收归仓。吕祖爷告诉你，这件事会有一个让各方面都满意的结果（两相全）。你很快就可以放下心中的大石，安心地回家享受天伦之乐，与家人共同庆祝这份来之不易的圆满和喜悦。", "advice": "胜利在望，现在只需保持稳健，做好最后的收尾工作，然后就可以安心地等待丰收的时刻了。别忘了，成功之后，最重要的就是与支持你的家人分享这份快乐，他们的笑容是你最大的福报。"},
{"id": 9, "title": "第九签", "type": "下下签", "poem": "龙虎相随在深山，君尔何须背后看。\n不知此去相爱愉，他日与我却无干。", "interpretation": "朋友，抽到这支签千万别慌！吕祖爷不是在预言坏事，而是像一位敏锐的老友，点出了你人际关系中可能存在的隐患。你身边或许有像‘龙虎’一样看似强大的伙伴或合作者，但关系并不像表面那么牢靠，对方可能各有打算。这不是你的错，只是提醒你要带眼识人，避免日后受伤。", "advice": "对于当前重要的合作关系，需要更深入地观察和评估。在涉及核心利益时，务必明确规则，保留必要的书面凭证。这不是让你怀疑一切，而是学会保护自己，把真心和信任留给真正值得的人。"},
{"id": 10, "title": "第十签", "type": "中平签", "poem": "风出丹山百鸟藏，时逢阳翅自翱翔。\n莫悲雁侣分飞去，幸遇风云际会长。", "interpretation": "朋友，这支签描绘了一个动态变化的局面。目前可能像凤凰出世百鸟藏匿，你感到有些孤独或助力减少。但吕祖爷告诉你，这只是因为属于你的‘阳翅’（高飞）时机还未完全到来。不必为暂时的分离或孤独而悲伤，你很快就会遇到属于自己的‘风云际会’，那将是更长久、更广阔的舞台。", "advice": "接受当下的暂时沉寂，把它当作积蓄力量的阶段。不要因为伙伴的暂时离开而气馁，你的舞台即将展开。保持积极，准备好你的能力，当时机来临（风云际会），你就能乘风而起，自在翱翔。"},
{"id": 11, "title": "第十一签", "type": "上上签", "poem": "雕鹗乘秋羽翼舒，好将玉兔捣长生。\n云程亦有鹏飞志，丹桂高攀第一枝。", "interpretation": "朋友，这是支气势如虹的上上签！吕祖爷说你就像秋日里羽翼丰满的雄鹰，正是大展宏图的好时机。你不仅拥有远大的志向（鹏飞志），还有能力去实现那些美好的、利于长远的计划（玉兔捣长生）。更预示你将在竞争中脱颖而出，夺得头筹，就像攀折丹桂最顶端的的那一枝！", "advice": "自信地展开你的抱负吧！无论是事业还是学业，现在都是全力冲刺、争取顶尖成绩的绝佳时机。不要畏惧竞争，你的实力足以让你独占鳌头。同时，别忘了兼顾长远发展，为可持续的成功打下基础。"},
{"id": 12, "title": "第十二签", "type": "中平签", "poem": "营图万事若冰澌，何必悭贪苦所为。\n只好静心闲处坐，待他兴变复奚疑。", "interpretation": "朋友，吕祖爷看到你为了各种事操心谋划，结果却像冰融化一样，感觉白费功夫，心里难免有些失落和纠结。他老人家心疼你，劝你一句：有些事强求不来，过于计较和贪求反而让自己更苦。现在最好的方式，就是放宽心，暂时从纷扰中抽身出来，静观其变。", "advice": "主动停下来，给自己一段安静休息的时间。暂时放下那些让你劳心费力却进展不大的计划。等待外部环境或时机自然发生变化，到时再行动，方向会更明确，效果也会更好。现在，休息就是前进。"},
{"id": 13, "title": "第十三签", "type": "下下签", "poem": "自从河洛周天数，演到出门交有功。\n一生心事凭谁诉，九江烟雨滴梧桐。", "interpretation": "朋友，这支签听起来有些孤寂，但吕祖爷是想告诉你，他完全理解你此刻的感受——就像积累了满腹的才华和心事（河洛周天数），却感觉无人可诉，无人能懂，仿佛独自在烟雨中听着雨打梧桐。这不是说你不行，而是预示一个需要你独自面对和经历的阶段，但这恰恰是未来‘交有功’（取得成功）的必经之路。", "advice": "有些路注定要一个人走，有些心事实在难以尽数对人言。试着将这些情绪和思考转化为文字、艺术或专注于某项深度工作。这段独处的时光正是你沉淀和升华的契机，耐住寂寞，日后自有功成之时。"},
{"id": 14, "title": "第十四签", "type": "上上签", "poem": "他乡遇故喜相欢，谁知遇故依旧还。\n求名求利总如此，生意经营亦不难。", "interpretation": "朋友，这可是支喜气洋洋的上上签！吕祖爷告诉你，你很快就会有‘他乡遇故知’这样的意外惊喜，而且这份好运带来的益处是持续性的（遇故依旧还）。无论是求取名声地位，还是谋求财富利益，都会像遇到老朋友帮忙一样，过程顺利，结果圆满。做生意或开展新项目，也同样会得遇助力，进展顺畅。", "advice": "积极拓展你的人脉网络，特别是留意与旧相识重新联系的机会。在追求目标时，可以多借助外力或合作关系。保持乐观开放的心态，好运和贵人就在不远处等着你，大胆去行动吧！"},
{"id": 15, "title": "第十五签", "type": "中平签", "poem": "八十原来是大耋，看看晚景遇良缘。\n虽然目下多危险，保汝平安去积钱。", "interpretation": "朋友，这支签用‘八十高龄’来比喻一个长周期，吕祖爷是想宽慰你：即便现阶段看起来有些波折和风险，但你的‘晚景’——也就是这件事的最终阶段——是会遇到良缘和好结果的。他老人家在给你吃定心丸，告诉你目前的风险是可控的，最终会平安度过，并有所积累。", "advice": "对待当前的事务，需要有长线思维和耐心。不必为眼前的些许风险而过度担忧，但要做好风险管理，稳步前行。只要坚持下去，不仅能化险为夷，还能在过程结束时积累下宝贵的经验或财富。"},
{"id": 16, "title": "第十六签", "type": "上上签", "poem": "官事悠悠难辨明，不如息了且归耕。\n傍人煽惑君休信，此事当权亲到成。", "interpretation": "朋友，这支签是在为你指点迷津！如果你正陷入某些复杂的纠纷或难以决断的事情中，吕祖爷劝你，与其在里面耗神费力、听信旁人的各种说法，不如先主动抽身出来，回归简单和根本（如同归耕）。事情的成败关键，在于你自己掌握主动权（当权），亲自去处理才能成功。", "advice": "对于纠结难明的事务，果断按下暂停键。不要被周围的信息所干扰，相信自己的判断。由你本人亲自、直接地去掌控和推进核心环节，当你收回主导权，事情自然就会明朗并走向成功。"},
{"id": 17, "title": "第十七签", "type": "中平签", "poem": "莫听闲言说是非，晨昏只好念阿弥。\n若将妄语为真实，画饼如何疗得饥。", "interpretation": "朋友，吕祖爷在此特别提醒你，近期要格外注意身边的流言蜚语和是非口舌。他告诉你，那些闲言碎语就像‘画饼’，根本不能当饭吃，如果你把它们当真，只会让自己内心混乱，解决不了任何实际问题。守住内心的平静，专注于自身，才是正道。", "advice": "关闭那些传播是非的渠道，不轻信，不传播。把精力和时间用在实实在在的事情上，或者通过阅读、学习、静思来充实内心。记住，真实的行动才能填补空虚，闲言碎语只会让人更加饥渴。"},
{"id": 18, "title": "第十八签", "type": "上上签", "poem": "金乌西坠兔东升，日夜循环亘古今。\n僧道得之无不利，士农工商各从心。", "interpretation": "朋友，这是支充满宇宙规律和永恒智慧的上上签！吕祖爷用日月交替、昼夜循环的自然现象告诉你，一切都有其固有的节奏和时机。无论是出世的僧道，还是入世的士农工商，只要顺应这个大道，按照规律行事，就能无所不利，心想事成。你的道路是光明的，只要顺势而为。", "advice": "审视你当前的努力是否符合事物发展的自然规律。不要逆势而动，学习顺应天时、地利与人和。无论是在工作还是生活中，找到那个正确的‘节奏’，然后安心地、持续地努力，成功就是水到渠成的事。"},
{"id": 19, "title": "第十九签", "type": "下下签", "poem": "嗟子从来未得时，今年星煞可欺施。\n营求动作皆不利，祈禳酌献宜施为。", "interpretation": "朋友，抽到这支签先别叹气！吕祖爷不是说你不行，而是非常直白地告诉你，眼下这段时期，天上的‘星煞’能量（可以理解为流年不利）确实会给你带来一些阻碍，让你感觉做什么都不顺，好像时机总不对。他这是在帮你找到问题的症结，而不是宣判你的失败。", "advice": "当前阶段，不宜进行大的投资、变动或主动进攻。最好的策略是‘守成’，处理好事务，多做一些积累福报、与人为善的事情（祈禳酌献宜施为的现代解读）。静待这段不利的运势过去，养精蓄锐，以备来时。"},
{"id": 20, "title": "第二十签", "type": "上上签", "poem": "一生心事向谁论，十八滩头说与君。\n世事尽从流水去，功名富贵等浮云。", "interpretation": "朋友，这支签蕴含着深刻的人生智慧。吕祖爷知道你可能心有千千结，无人可诉。他借‘十八滩头’的险急流水告诉你，世间万事，包括你纠结的心事，都会像流水一样成为过去。而那些你追求的功名富贵，也如同天上的浮云，变幻无常。这是在引导你看向更超脱、更本质的生命价值。", "advice": "学会放下对具体人事和功利结果的过度执着。找一种适合自己的方式（比如与信任的朋友倾诉、写日记、走近大自然）疏解心事。把关注点从外界的浮华回归到内心的平静与充实，你会发现一种更自在、更有力量的生活状态。"},{
"id": 21,
"title": "第二十一签",
"type": "上上签",
"poem": "与君夙昔结成冤，今日相逢那得缘。\n好把经文多讽诵，祈求户内保婵娟。",
"interpretation": "朋友，这支签点出了人际关系中的一段因果。你与某人过去可能有些误会或纠葛（结成冤），所以现在相处总觉得缘分不够。但吕祖爷告诉你，化解之道不在争辩，而在修养内心。通过提升自我（如诵读经典般沉淀心性），不仅能改善关系，更能保佑家宅平安和谐。",
"advice": "主动放下过往恩怨，用包容和理解对待眼前人。多花时间修身养性，提升自己的格局。当你的内心变得柔和宽广时，外在的人际关系自然会随之改善，家庭氛围也会更加温馨。"
},
{
"id": 22,
"title": "第二十二签",
"type": "中平签",
"poem": "碧玉池中开白莲，庄严色相自天然。\n生来骨格超凡俗，正是人间第一仙。",
"interpretation": "朋友，这支签在赞美你的本性！吕祖爷说你就像碧玉池中的白莲，品格高洁，气质超凡，有着不同于常人的优秀潜质。他提醒你要认识并珍惜自己的这份‘仙骨’，不要被世俗的纷扰所染，保持内心的纯净与自然。",
"advice": "相信自己的独特价值和内在力量。在生活和工作中，坚持做最真实、最优秀的自己，不必刻意迎合世俗标准。你的天然魅力会为你吸引来真正的欣赏与机遇。"
},
{
"id": 23,
"title": "第二十三签",
"type": "下下签",
"poem": "花开花谢在春风，贵贱穷通百岁中。\n羡子荣华今已矣，到头万事总成空。",
"interpretation": "朋友，看到‘成空’二字先别慌！吕祖爷不是否定你的努力，而是用花开花落的自然规律，引导你看透人生的起伏。他提醒我们，无论是荣华富贵还是艰难困苦，都只是生命长河中的一段过程。重要的是体验当下，而非执着于最终是否‘拥有’。",
"advice": "学习用更超然的心态看待得失。珍惜并享受努力的过程本身，而不是只为那个结果。减少对物质成败的过度执着，你会发现自己反而更能轻松前行，享受生命的丰盛。"
},
{
"id": 24,
"title": "第二十四签",
"type": "上上签",
"poem": "玉堂金马遭际难，一旦峥嵘非等闲。\n他日乘云归紫府，定当位列仙班间。",
"interpretation": "朋友，这是支预示人生飞跃的上上签！吕祖爷说你虽然曾经历‘玉堂金马’般的高要求而际遇艰难，但一旦突破，便是非同凡响的成就。他更预示你未来将达到极高的境界（如位列仙班），这是对你潜力的极大肯定！",
"advice": "坚持你正在走的高标准道路，眼前的困难是淬炼。保持信心，你的突破性时刻即将到来。持续提升自我，你的才华终将让你在更高的平台上绽放光芒。"
},
{
"id": 25,
"title": "第二十五签",
"type": "中平签",
"poem": "寅午戌年多阻滞，亥子丑月渐亨嘉。\n待逢玉兔金鸡会，枯木逢春自放花。",
"interpretation": "朋友，这支签像一份运势时间表！吕祖爷告诉你，在某些年份（如虎马狗年）可能会感觉不顺，但在特定月份（如猪鼠牛月）就会慢慢好转。而到了兔年或鸡年，你将迎来‘枯木逢春’般的大好时机，所有积累都会绽放。",
"advice": "理解运势有起伏是正常规律。不顺时耐心积累，好运时积极把握。重点关注下半年和特定的生肖年份，提前规划。你的‘春天’已在路上，请做好准备迎接。"
},
{
"id": 26,
"title": "第二十六签",
"type": "上上签",
"poem": "世间万物各有主，一粒一毫君莫取。\n英雄豪杰自天生，也须步步循规矩。",
"interpretation": "朋友，这支签在讲安身立命的大智慧！吕祖爷提醒要尊重界限，‘非我所有，一毫莫取’，这是长久平安的基石。同时肯定你是‘英雄豪杰’的材料，但成就事业必须脚踏实地，遵守规则。",
"advice": "坚守诚信底线，不贪不义之财。发挥你的豪杰气概，但务必在法律和道德框架内行事。一步一个脚印，你的成功才会坚实而长久。"
},
{
"id": 27,
"title": "第二十七签",
"type": "中平签",
"poem": "君尔何须问圣神，荣枯得失数前因。\n今年运限无周折，只恐秋冬反覆频。",
"interpretation": "朋友，吕祖爷看出你有些焦虑想来问个究竟。他说当前的荣枯得失都有前因，今年整体运势平稳，无需过度担心。只是提醒你要特别注意秋冬时节，可能会有些反复和波折，需要提前留心。",
"advice": "接纳现状，理解这是过去选择的自然结果。上半年可稳步推进计划，但进入秋冬后要更加谨慎，留有余地应对可能的变化。保持平常心，稳扎稳打。"
},
{
"id": 28,
"title": "第二十八签",
"type": "下下签",
"poem": "东方月上正婵娟，顷刻云遮亦暗然。\n或有圆时还有缺，更言非者亦闲言。",
"interpretation": "朋友，这支签用月有阴晴圆缺比喻世事无常。吕祖爷告诉你，即使像东方明月般美好的事物，也可能瞬间被乌云遮蔽。有圆满就有缺憾，旁人的闲言碎语更不必放在心上。他是在教你用平常心看待变化。",
"advice": "好事发生时不过喜，遇到挫折不过忧。对于人际关系中的是非口舌，一笑置之。学会在变化中保持内心的稳定，专注自己能掌控的事情。"
},
{
"id": 29,
"title": "第二十九签",
"type": "上上签",
"poem": "祖宗积德几多年，源远流长庆自然。\n若更操修无倦已，天须还汝旧青毡。",
"interpretation": "朋友，这是支承前启后的上上签！吕祖爷说你家风淳厚，祖上积德，福泽绵长。只要你继续不懈地修养德行、努力奋斗，上天必定会让你继承并光大这份家业（旧青毡），让好运自然延续。",
"advice": "为你的家庭传统感到自豪，并用自己的善行和努力去增光添彩。保持勤奋和道德操守，你不仅是在为自己奋斗，更是在传承一份美好的福报。"
},
{
"id": 30,
"title": "第三十签",
"type": "中平签",
"poem": "绿柳苍松正当时，任君此去作乾坤。\n贵人与你相助力，稳情得意喜欣欣。",
"interpretation": "朋友，这支签显示时机正好！吕祖爷说你现在如绿柳苍松般充满生机，正是大展拳脚的好时候。而且会有贵人出手相助，让你的事情进展顺利，结果令人满意。整体运势是积极向上的。",
"advice": "抓住当前有利时机，积极主动地推进你的计划。同时要留意并珍惜身边可能出现的贵人，虚心接受帮助。保持乐观，成功在望。"
},
{
"id": 31,
"title": "第三十一签",
"type": "下下签",
"poem": "秋冬作事只寻常，春到门庭渐吉昌。\n千里信音符远望，萱堂快乐未渠央。",
"interpretation": "朋友，这支签给出了明确的时间表！吕祖爷说秋冬期间做事平平，不要强求。但一到春天，家运就会逐渐兴旺吉祥。还会有远方的喜讯传来，母亲（或家庭女性长辈）安康快乐。这只是在等待合适的时机。",
"advice": "秋冬宜守成，养精蓄锐。把重要计划和行动安排在来年春天。多关心家人，特别是母亲的身体和情绪。耐心等待，好运和好消息自会随春而至。"
},
{
"id": 32,
"title": "第三十二签",
"type": "上上签",
"poem": "龙吟虎啸镇山崖，凤翥鸾翔集帝阶。\n一旦风云相际会，时人莫妄猜疑猜。",
"interpretation": "朋友，这是支气势磅礴的上上签！吕祖爷用龙虎风云、鸾凤翔集描绘出你即将迎来的宏大场面。当时机来临（风云际会），你将展现出震慑众人的力量与风采，成就非凡，让所有旁观者都不得不服。",
"advice": "继续积累实力，静待那个属于你的关键时机到来。一旦机会出现，就要像龙虎一样毫不犹豫地展现全部能力。你的成就将超出常人想象，不必在意他人猜疑。"
},
{
"id": 33,
"title": "第三十三签",
"type": "中平签",
"poem": "内藏无价宝和珍，得玉何须外界寻。\n不如等待高人识，宽心犹存更待时。",
"interpretation": "朋友，吕祖爷在提醒你向内看！你本身就蕴藏着无价的珍宝（才华、潜力），无需向外苦苦追寻。现在需要的不是盲目行动，而是耐心等待能赏识你的‘高人’出现，同时放宽心态，静候时机。",
"advice": "停止自我怀疑，认识到自己的独特价值。在伯乐出现之前，继续默默打磨你的‘宝玉’。保持耐心和开放的心态，属于你的机遇一定会来发现你。"
},
{
"id": 34,
"title": "第三十四签",
"type": "下下签",
"poem": "功名富贵自能为，偶着仙鞭莫问伊。\n万里鹏程君有分，吴山顶上录棱枝。",
"interpretation": "朋友，这支签看似矛盾实则充满深意。吕祖爷说功名富贵本可靠自己争取，但偶尔也需要一点‘仙鞭’（运气/贵人）助推。他肯定你必有‘万里鹏程’，但过程可能像在吴山攀折带刺的枝条，需经历艰辛。",
"advice": "一方面要自信自强，努力争取；另一方面也要接纳过程中的困难与必要的运气成分。不畏艰辛，勇敢地去追求你的远大前程，过程中的每一步攀登都在成就你。"
},
{
"id": 35,
"title": "第三十五签",
"type": "上上签",
"poem": "衣冠重整旧家风，道是无功却有功。\n扫却当途荆棘碍，三人共议事和同。",
"interpretation": "朋友，大吉大利！这支签预示着你将光耀门楣，重振家声。看似平淡的努力其实暗藏功绩。你将能清除前进道路上的障碍，并且与志同道合的伙伴（三人）和谐共事，达成一致，共同成就事业。",
"advice": "从整顿自身和家庭环境开始，建立良好形象。坚持你认为正确的努力，其价值终将显现。积极寻找可靠的合作伙伴，团队的力量将帮你扫清障碍，实现目标。"
},
{
"id": 36,
"title": "第三十六签",
"type": "中平签",
"poem": "一舟行货好招邀，积少成多自富饶。\n常把他人比自己，管须日后胜今朝。",
"interpretation": "朋友，这支签在教你聚沙成塔的智慧！吕祖爷说你的‘货物’（技能、项目）很好，值得推广。通过点滴积累，自然能变得富足。更要常常换位思考，体谅他人，这样未来的日子一定会比现在更好。",
"advice": "踏实经营你现有的资源，相信积累的力量。在人际交往中多些理解和包容。坚持这样做，你的财富（物质和精神）会稳步增长，生活必然蒸蒸日上。"
},
{
"id": 37,
"title": "第三十七签",
"type": "下下签",
"poem": "焚香来告复何辞，善恶平分汝自知。\n屏却昧公心里事，出门无碍是通时。",
"interpretation": "朋友，吕祖爷在此恳切地提醒你审视内心！你的是非善恶，自己其实最清楚。如果心里藏着些不公正、不光明的念头（昧公事），就会阻碍你的发展。只有摒除这些，才能豁然开朗，前路畅通。",
"advice": "真诚地反思自己近期的起心动念，清理那些不够光明正大的想法。让内心变得坦荡无私，当你自己心无挂碍时，外在的道路自然就会顺畅起来。"
},
{
"id": 38,
"title": "第三十八签",
"type": "上上签",
"poem": "蛩吟唧唧守孤帏，千里悬悬望信归。\n等得荣华公子到，秋冬括括雨霏霏。",
"interpretation": "朋友，这支签描绘了等待与希望的画面！你可能曾像秋虫般在孤寂中坚守，殷切期盼远方的消息或转机。吕祖爷告诉你，你等待的‘荣华公子’（象征好运、贵人或机遇）即将到来，即便过程伴随些风雨（秋冬括括），但结果是圆满的。",
"advice": "你长期的坚守是值得的。请继续保持信心，你期盼的好运或关键人物正在路上。对于过程中可能出现的些许波折（如风雨），做好心理准备，它们不影响最终的好结果。"
},
{
"id": 39,
"title": "第三十九签",
"type": "中平签",
"poem": "天边消息应难问，切莫私心强望求。\n若把石头磨作镜，精神枉费一时休。",
"interpretation": "朋友，吕祖爷在此提醒你要务实！对于那些遥远渺茫、难以验证的‘天边消息’，不要凭私心去强求。如果执意要做那些如同‘磨石成镜’般不可能成功的事，只会白白耗费你的精神，不如及早停下。",
"advice": "把注意力从那些不切实际的幻想或难以企及的目标上收回来。专注于眼前可行、能出成果的事情。停止无效努力，把精力用在刀刃上，这才是明智之举。"
},
{
"id": 40,
"title": "第四十签",
"type": "上上签",
"poem": "红轮西坠兔东升，阴长阳消百事亨。\n若是女人宜望用，增添财禄福其子。",
"interpretation": "朋友，这是支运势转换的上上签！吕祖爷用日月交替比喻‘阴长阳消’，预示此后一段时期百事亨通。对于女性朋友尤为有利，无论是在个人发展还是家庭财运、子嗣福气方面，都会有显著的提升和增添。",
"advice": "顺应运势的转变，积极拓展。女性朋友可以大胆把握这个阶段的机遇。多关注与家庭、财富积累和子女相关的事务，容易获得美好的成果。"
},
{
"id": 41,
"title": "第四十一签",
"type": "中平签",
"poem": "无限好山君记取，桃红柳绿眼中迷。\n莫道老来方学道，孤坟多是少年人。",
"interpretation": "朋友，这支签在提醒我们珍惜当下、感悟人生。吕祖爷说世间美景（无限好山）要用心记住，但也不要被眼前的繁华（桃红柳绿）所迷惑。他特别点明：修行悟道不必等年老，因为生命无常，提醒我们要及早明心见性，活出真我。",
"advice": "欣赏生活中的美好，但保持清醒不沉迷。把每一天都当作修行的机会，提升心性，明辨是非。不要拖延对生命意义的探索，现在就活出充实和觉悟。"
},
{
"id": 42,
"title": "第四十二签",
"type": "上上签",
"poem": "皇都得意早回鞭，锦瑟年华莫负天。\n好把麟儿勤教育，成名端在鲤庭前。",
"interpretation": "朋友，这是支关于成功与传承的上上签！吕祖爷说你在取得成就（皇都得意）后要懂得适时收手，珍惜大好青春（锦瑟年华）。更重要的是要好好教育下一代（麟儿），孩子的成名成才就在你的悉心教导之下（鲤庭前）。",
"advice": "事业成功时要懂得知足，留时间给家庭。特别要重视子女教育，你的言传身教是孩子最好的成长养分。投资下一代，就是投资最美好的未来。"
},
{
"id": 43,
"title": "第四十三签",
"type": "下下签",
"poem": "一纸官书火急催，扁舟东下浪如雷。\n虽然目下多惊险，保汝平安去复回。",
"interpretation": "朋友，看到这支签先别紧张！吕祖爷描绘了一个紧急又惊险的局面，好像有急事催逼，过程波涛汹涌。但他明确告诉你：尽管眼下看起来危机四伏，但最终能保你平安往返，有惊无险。这是在考验你的应变能力。",
"advice": "遇到紧急事务保持冷静，虽然过程可能充满挑战，但只要沉着应对，必能化险为夷。相信自己的能力和运气，这次经历反而会让你变得更加强大。"
},
{
"id": 44,
"title": "第四十四签",
"type": "中平签",
"poem": "汝是人中最吉人，也为误作误为因。\n如今要辨吉人路，莫把灵丹染俗尘。",
"interpretation": "朋友，吕祖爷说你这人本质很好（最吉人），只是有时会因为错误的想法和行为走了弯路。现在你需要认清真正吉利的人生道路，不要让那颗原本灵明的心（灵丹）被世俗的欲望所污染。",
"advice": "回归本心，反思近期是否有偏离初衷的言行。保持内心的纯净和正直，不被外界诱惑带偏。走回你原本善良光明的正道，这才是真正的吉祥之路。"
},
{
"id": 45,
"title": "第四十五签",
"type": "上上签",
"poem": "好将亲上又重亲，看来世事有来因。\n明镜当台辉宝鉴，桂花须赖东风力。",
"interpretation": "朋友，大吉大利！这支签预示亲上加亲的美事，说明世事皆有美好因果。吕祖爷说你心如明镜，能照见事理，但成功的实现（桂花飘香）还需要借助一些外力（东风），可能是贵人或是时机。",
"advice": "珍惜并加强现有的亲密关系（家人、朋友、合作伙伴），会带来好运。保持清醒的头脑观察事物，同时要善于借助外力，抓住关键时机促成好事。"
},
{
"id": 46,
"title": "第四十六签",
"type": "中平签",
"poem": "长安岂是乏主人，自古黄金贵有因。\n寄语弹冠二三客，休将容貌竞时新。",
"interpretation": "朋友，这支签在讲择主而事与内在价值的道理。吕祖爷说长安（指发达之地）不缺赏识人才的明主，黄金贵重自有其道理。他提醒那些准备出仕（弹冠）的人，不要只注重外表的光鲜，而要追求真正的价值。",
"advice": "在选择平台或领导时，要看重其实力和内涵，而非表面风光。提升自己的真才实学比包装外表更重要。是金子总会发光，内在价值永远是最可靠的资本。"
},
{
"id": 47,
"title": "第四十七签",
"type": "下下签",
"poem": "与君万语复千言，只欲平和雪尔冤。\n讼则终凶君记取，试于清夜把心扪。",
"interpretation": "朋友，吕祖爷苦口婆心在劝和你！他千言万语只希望你能平和解决冤屈，记住'讼则终凶'——打官司到最后对谁都不好。他请你在夜深人静时扪心自问，是否真的非要争个你死我活。",
"advice": "遇到纠纷冲突，首选和解与调解。诉讼是最后的手段，且代价很大。静下心来反思，退一步海阔天空，用和平方式解决矛盾对所有人都好。"
},
{
"id": 48,
"title": "第四十八签",
"type": "上上签",
"poem": "登山涉水正天寒，兄弟姻亲那得安。\n不遇虎头人一唤，全家谁保汝重欢。",
"interpretation": "朋友，这支签先苦后甜！吕祖爷说目前处境如登山涉水般艰辛，家人亲友也难得安宁。但转机就在'虎头人'（可能指属虎贵人或有权威者）的出现，他一召唤，就能保全全家重获欢乐。",
"advice": "暂时忍耐眼前的困难，转机即将出现。留意身边可能帮助你的权威人士或特定属相的朋友。家庭团结是关键，共渡难关后必享团圆之乐。"
},
{
"id": 49,
"title": "第四十九签",
"type": "中平签",
"poem": "彼此居家只一山，如何似隔鬼门关。\n日月如梭人易老，许多劳碌不如闲。",
"interpretation": "朋友，这支签在感叹人际的隔阂与时光的珍贵。吕祖爷说虽然物理距离很近（只一山），心理却如隔鬼门关般遥远。他提醒你光阴似箭，人生易老，许多忙碌其实不如清闲自在更有价值。",
"advice": "主动打破与身边人的隔阂，珍惜眼前缘分。重新评估你的时间分配，减少无效忙碌，多留些时间给真正重要的人和事，享受生活的闲适之美。"
},
{
"id": 50,
"title": "第五十签",
"type": "上上签",
"poem": "人说今年胜旧年，也须步辇要周旋。\n一家和气多生福，萋菲谗言莫听偏。",
"interpretation": "朋友，大吉大利！这支签说今年运势确实比去年好，但需要你用心经营（步辇周旋）。一家人的和气最能生发福气，同时千万不要偏听那些挑拨离间的谗言（萋菲谗言）。",
"advice": "趁着好运积极行动，但要注重人际关系的维护。把家庭和睦放在首位，这是福气的根源。警惕小人谗言，保持自己的判断力，不被挑拨。"
},
{
"id": 51,
"title": "第五十一签",
"type": "中平签",
"poem": "君今百事且随缘，水到渠成听自然。\n莫叹年来不如意，喜逢新运称心田。",
"interpretation": "朋友，吕祖爷劝你此刻不妨随缘！各种事情就让它顺其自然，像水到渠成般发展。不要为过去一年的不如意而叹息，你将迎来称心如意的新运势。",
"advice": "放下过度掌控的心态，学会随顺因缘。对过去释怀，以开放心态迎接新的开始。相信自然的安排，当时机成熟，一切都会水到渠成。"
},
{
"id": 52,
"title": "第五十二签",
"type": "下下签",
"poem": "兀坐幽居叹寂寥，孤灯掩映度清宵。\n黄金忽报秋光好，活计还如二月娇。",
"interpretation": "朋友，这支签先寂寥后转机！吕祖爷说你现在可能感到孤独冷清，在寂寞中度过时光。但好消息是，转机突然就会到来（黄金秋光），你的生计事业会像二月春花般重新焕发生机。",
"advice": "忍耐暂时的孤寂，这是在为未来的繁荣积蓄力量。保持希望，转机往往在不经意间出现。做好准备，当时机到来，就能抓住机会重振旗鼓。"
},
{
"id": 53,
"title": "第五十三签",
"type": "上上签",
"poem": "艰难险阻路蹊跷，南鸟孤飞依北巢。\n今日贵人曾识面，相逢却在夏秋交。",
"interpretation": "朋友，这是支贵人相助的上上签！吕祖爷说虽然前路艰难险阻，你像南方的鸟要在北方筑巢般不易。但有位你曾见过的贵人会在夏秋之交出现并帮助你，一切困难都将迎刃而解。",
"advice": "坚持度过眼前的困难时期，留意夏秋之交出现的机会。那位曾经认识的贵人将是你转折的关键，保持联系，适时求助。"
},
{
"id": 54,
"title": "第五十四签",
"type": "中平签",
"poem": "万人丛里逞英豪，便欲飞腾霄汉高。\n争奈承流风未便，青灯黄卷且勤劳。",
"interpretation": "朋友，这支签在说厚积薄发的道理。吕祖爷肯定你的英豪气概和远大志向（飞腾霄汉）。但时机未到（风未便），还需要你静心学习积累（青灯黄卷），继续勤劳准备。",
"advice": "保持你的雄心壮志，但要有耐心。在机遇来临前，沉下心来读书学习，提升能力。当时的东风到来时，你积累的学识就能助你一飞冲天。"
},
{
"id": 55,
"title": "第五十五签",
"type": "上上签",
"poem": "子庭讼理且休论，贵人相助得明君。\n但存公道退私曲，此去亨通脱苦斤。",
"interpretation": "朋友，大吉大利！这支签说官司纠纷（子庭讼理）不必担忧，会有贵人相助遇到明理之人。只要你秉持公道、去除私心，从此就能通达顺利，摆脱困扰。",
"advice": "对于纠纷保持冷静，相信公正自会彰显。坚守公道正义，贵人自会出现相助。放下私心杂念，前路必然畅通无阻。"
},
{
"id": 56,
"title": "第五十六签",
"type": "中平签",
"poem": "沙里淘金德未孤，世人相识岂无殊。\n凭君莫怨人情薄，到处春山是故吾。",
"interpretation": "朋友，吕祖爷在教你识人的智慧。他说在沙里淘金般寻找有德之士并不孤单，世人相识本就有不同层次。不要埋怨人情淡薄，其实处处春山（美好境界）都能找到志同道合的朋友。",
"advice": "珍惜真正的朋友，不必强求所有人都理解你。用开放的心态看待人际关系，你会发现处处都有知音。提升自己，自然能吸引同频的人。"
},
{
"id": 57,
"title": "第五十七签",
"type": "下下签",
"poem": "说是说非风过耳，好衣好禄自然丰。\n君莫记取当年事，汝意还如我意同。",
"interpretation": "朋友，吕祖爷在劝你放下执着！那些是是非非就当耳边风吹过，该有的好生活自然会来。不要再惦记着过去的恩怨纠葛（当年事），你的心意应该和我一样——向前看。",
"advice": "不听是非，不传闲言。放下过往恩怨，专注创造当下的美好生活。相信属于你的福报自然会来，不必为过去烦恼。"
},
{
"id": 58,
"title": "第五十八签",
"type": "上上签",
"poem": "苏秦三寸足平生，富贵功名在此行。\n更好修为阴骘事，前程万里有通亨。",
"interpretation": "朋友，大吉大利！这支签说你有苏秦般的口才与智慧，此去必得功名富贵。如果还能多做一些积德行善的事（阴骘事），前程更是万里通达，无所阻碍。",
"advice": "充分发挥你的才智和沟通能力去追求目标。同时要多做善事，积累阴德。才能与德行兼备，必能成就大业，前程似锦。"
},
{
"id": 59,
"title": "第五十九签",
"type": "中平签",
"poem": "门衰户冷苦伶仃，自叹祈求不一灵。\n幸有祖宗阴骘在，香烟未断续螟蛉。",
"interpretation": "朋友，吕祖爷理解你门庭冷落、孤苦无依的感受，似乎求什么都不灵验。但他指出幸运的是祖宗积德深厚（阴骘在），香火传承不会断绝，后继有人（续螟蛉）。",
"advice": "虽然眼下孤单，但要感念祖德庇佑。家族的福泽还在，会有传承香火的人出现。保持信心，最困难的时候已经过去，曙光就在前方。"
},
{
"id": 60,
"title": "第六十签",
"type": "上上签",
"poem": "羡君兄弟好名声，只管谦撝莫自矜。\n但把秋风借一便，九重天上奋鹏程。",
"interpretation": "朋友，大吉大利！这支签称赞你们兄弟（或伙伴）名声很好，只需保持谦逊不要骄傲。只要借助合适的时机（秋风一便），就能直上九重天，如大鹏展翅般前程远大。",
"advice": "珍惜并维护良好的声誉，继续保持谦逊态度。善于把握时机，当时运到来时勇敢展翅高飞。团队合作能助你达到个人难以企及的高度。"
},
{
"id": 61,
"title": "第六十一签",
"type": "中平签",
"poem": "啸聚山林凶恶俦，善良无事苦煎忧。\n主人大笑出门去，不用干戈盗贼休。",
"interpretation": "朋友，这支签描绘了邪不压正的道理。吕祖爷说虽然有时恶人聚集（啸聚山林），让善良的人备受煎熬。但主人（指正气、正道）能从容应对，不费一兵一卒就让盗贼（指邪恶、麻烦）自行消散。",
"advice": "面对邪恶或不公，不必硬碰硬。保持正气和从容，相信正义自有力量。用智慧和气度化解矛盾，往往能不战而胜。"
},
{
"id": 62,
"title": "第六十二签",
"type": "上上签",
"poem": "百千人面虎狼心，赖汝干戈用力深。\n得胜回时秋渐老，虎头城里喜相寻。",
"interpretation": "朋友，这是支先苦后甜的上上签！吕祖爷说虽然周围可能人心险恶（虎狼心），但你凭借自己的努力和斗争（干戈）终将获胜。虽然胜利来得稍晚（秋渐老），但最终会在重要地方（虎头城）收获喜悦。",
"advice": "坚持对抗困难，你的努力不会白费。胜利可能迟到但不会缺席，耐心等待最终的成功。在关键时刻要全力以赴，必能得偿所愿。"
},
{
"id": 63,
"title": "第六十三签",
"type": "中平签",
"poem": "曩时败北且图南，筋力虽衰尚一堪。\n欲识生前君大数，前三三与后三三。",
"interpretation": "朋友，吕祖爷在说命运轮回的奥秘。虽然曾经失败（败北），但现在可以转向南方（新的方向），即使精力不如从前但仍可一搏。要知道命运的大数，前三三后三三暗示着因果循环、周而复始的道理。",
"advice": "不要被过去的失败束缚，转向新的方向重新开始。虽然精力有限，但仍可尽力一搏。理解命运的周期性，保持耐心和希望。"
},
{
  "id": 64,
  "title": "第六十四签",
  "type": "下下签", 
  "poem": "金乌西坠兔东升，日夜循环至古今。\n僧道得知无不利，士农工商各从心。",
  "interpretation": "朋友，这支签用日月循环揭示了一个深刻的道理。吕祖爷说，就像太阳落下月亮升起，万事万物都有其盛衰更替的规律。此时正处在‘金乌西坠’的下行阶段，运势较为低迷。虽然僧道之人明白此理能随遇而安，但对于世俗中的士农工商而言，在这种周期里强求事事顺心，反而容易徒劳无功。这是在提醒你，当下宜静不宜动。",
  "advice": "认清当前正处于运势周期中的低谷阶段，避免做重大的投资、决策或变动。学习僧道之人的豁达，顺应自然规律，休养生息。耐心等待‘兔东升’的转机到来，届时再图发展。"
},
{
"id": 65,
"title": "第六十五签",
"type": "上上签",
"poem": "苦而甘来报晓星，金牛火鼠渐亨通。\n出入营谋皆遂意，闲居饱饭享太平。",
"interpretation": "朋友，大吉大利！这支签预示苦尽甘来，好运如启明星般升起。在牛年鼠年（或泛指某个时期）运势逐渐亨通，外出经营都能如愿，可以悠闲地享受太平日子。",
"advice": "坚持度过最后的困难时期，曙光就在眼前。把握牛年鼠年的好运势，积极行动。成功后也要懂得享受生活，保持平和心态。"
},
{
"id": 66,
"title": "第六十六签",
"type": "中平签",
"poem": "路险马行人去远，失群孤雁独南飞。\n钱塘江上潮信稳，跨马骑牛便得归。",
"interpretation": "朋友，这支签描绘了孤独与回归的画面。吕祖爷说前路艰险同伴远去，你如失群孤雁。但钱塘潮信（指规律、时机）稳定时，无论骑马骑牛（不同方式）都能平安归来。",
"advice": "暂时忍受孤独，这是成长的必经之路。相信时机的必然性，当时机成熟时，无论用什么方法都能达成目标。保持信心，终会回归正轨。"
},
{
"id": 67,
"title": "第六十七签",
"type": "下下签",
"poem": "雷雨风云各有司，至诚祷告莫生疑。\n与君定约麟霄日，细把愁眉作柳枝。",
"interpretation": "朋友，吕祖爷在说天意与诚心的关系。自然现象各有掌管（雷雨风云），只要至诚祈祷不要怀疑。他与你约定在美好日子（麟霄日），到时就能舒展愁眉如柳枝般轻松。",
"advice": "对天地保持敬畏和虔诚，不要怀疑诚心的力量。虽然现在有烦恼，但美好时光已经约定。保持希望，愁苦终将过去。"
},
{
"id": 68,
"title": "第六十八签",
"type": "上上签",
"poem": "南贩珍珠北贩盐，年来几次倍伤廉。\n劝君止此求田舍，心欲多时何日厌。",
"interpretation": "朋友，这支签在提醒知足常乐。吕祖爷说南北经商虽然获利，但多次损害了廉洁。劝你适可而止，回归田园生活，欲望太多永远无法满足。",
"advice": "在追求财富时要保持底线，不要损害品德。学会知足，适时回归简单生活。减少贪欲，才能获得真正的满足和快乐。"
},
{
"id": 69,
"title": "第六十九签",
"type": "中平签",
"poem": "冬来岭上一枝梅，叶落枝枯总不摧。\n但得阳春消息至，依然还我作花魁。",
"interpretation": "朋友，这支签用梅花喻人生。吕祖爷说你现在如冬日的梅花，虽然枝叶凋零但本质不毁。只要等到春天消息到来，依然能绽放为花中之魁。",
"advice": "在困难时期保持坚韧本性，如梅花般傲霜斗雪。耐心等待时机的转变，当时运到来时，你依然能绽放光彩。现在的沉寂是为未来的绽放积蓄力量。"
},
{
"id": 70,
"title": "第七十签",
"type": "上上签",
"poem": "朝暾煜煜上天衢，凤翥鸾翔夹帝车。\n一日丝纶方到手，须臾直上九霄居。",
"interpretation": "朋友，大吉大利！这支签描绘了辉煌腾达的景象。朝阳灿烂照耀天路，凤凰鸾鸟簇拥帝车。一旦得到机遇（丝纶到手），瞬间就能直上九霄，达到极高境界。",
"advice": "保持积极向上的状态，准备迎接重要机遇。当时机来临时果断把握，就能实现飞跃。你的前途无比光明，必能达到理想高度。"
},
{
"id": 71,
"title": "第七十一签",
"type": "中平签",
"poem": "一年作事急如飞，君尔宽心莫迟疑。\n但等三冬烧过后，遍船装载宝贝归。",
"interpretation": "朋友，吕祖爷看出你做事急切如飞，劝你放宽心不要迟疑。只要等到寒冬过后（三冬烧过），就能满载宝贝而归，收获丰硕成果。",
"advice": "放慢节奏，不要过于急躁。耐心等待时机的成熟，特别是在冬季过后。保持信心，届时自然会有丰厚的回报。"
},
{
"id": 72,
"title": "第七十二签",
"type": "下下签",
"poem": "兔儿久待洞中麻，无限闲愁寄落花。\n但得东风勤借力，好看明月上窗纱。",
"interpretation": "朋友，这支签描绘了等待与希望。吕祖爷说如兔儿在洞中久待，闲愁如落花。但只要得到东风助力，就能看到明月照窗的美好景象。",
"advice": "在等待时期保持耐心，愁绪终会如落花消散。留意并借助外力的帮助（东风），当时机到来，自能享受美好时光。"
},
{
"id": 73,
"title": "第七十三签",
"type": "上上签",
"poem": "忆昔兰房分半钗，而今忽把信音乖。\n痴心指望成连理，到底谁知事不谐。",
"interpretation": "朋友，这支签在说感情变化的无常。吕祖爷回忆过去恩爱（分半钗），如今却音信断绝。虽然痴心指望结合（成连理），但终究事与愿违。这是在教你放下执着。",
"advice": "对于已经变化的感情，要学会接受和放下。不要执着于无法实现的愿望，放开过去才能迎接新的可能。缘分天定，强求不得。"
},
{
"id": 74,
"title": "第七十四签",
"type": "中平签",
"poem": "崔巍崔巍复崔巍，履险如夷去复来。\n身似菩提心似镜，长安一道放春回。",
"interpretation": "朋友，这支签在说险境与心境的关系。吕祖爷说虽然前路险峻（崔巍），但能履险如夷往来自如。只要身心清净（身似菩提心似镜），就能在长安道上迎接春天。",
"advice": "面对险境保持平和心境，就能化险为夷。修养身心，保持清明，无论外界如何都能从容应对。春天终将到来，希望永在。"
},
{
"id": 75,
"title": "第七十五签",
"type": "上上签",
"poem": "宛如仙鹤出凡笼，脱得凡笼路路通。\n南北东西无阻隔，任君直上九霄宫。",
"interpretation": "朋友，大吉大利！这支签说如仙鹤出笼，脱离束缚后路路畅通。无论东南西北都没有阻碍，任你直上九霄，达到极高境界。",
"advice": "摆脱束缚你的旧有框架，就能海阔天空。勇敢追求理想，前路畅通无阻。你的潜力无限，必能达到惊人高度。"
},
{
"id": 76,
"title": "第七十六签",
"type": "中平签",
"poem": "鱼龙混杂意和同，耐守寒潭未济通。\n不觉一朝头角耸，禹门一跳化龙宫。",
"interpretation": "朋友，这支签在讲等待化龙的时机。吕祖爷说现在环境复杂（鱼龙混杂），需要耐心守候（耐守寒潭）。一旦时机到来头角显露，就能跃过龙门化身为龙。",
"advice": "在复杂环境中保持耐心，继续积累力量。等待展现才华的时机，当时机成熟时勇敢一跃，必能化平凡为非凡。"
},
{
"id": 77,
"title": "第七十七签",
"type": "下下签",
"poem": "梦中说得是多财，声名云外总虚哉。\n水远山遥难信定，贵人相暗笑颜开。",
"interpretation": "朋友，吕祖爷在提醒现实与虚幻。梦中说的财富名声都是虚幻的（云外虚哉），远水难解近渴。只有贵人相助才能带来真正的喜悦。",
"advice": "不要沉迷于不切实际的幻想，要面对现实。远离那些虚无的承诺，寻找真正可靠的帮助。贵人的实际支持比虚幻的名利更重要。"
},
{
"id": 78,
"title": "第七十八签",
"type": "上上签",
"poem": "冷水未烧白涕汤，不寒不热有温凉。\n要行天下无他事，为有身中百艺强。",
"interpretation": "朋友，大吉大利！这支签说如冷水烧成适口汤，不冷不热温度正好。行走天下无所畏惧，只因自身技艺超群（百艺强）。",
"advice": "掌握好做事的火候，不急不缓恰到好处。不断提升自身能力，多才多艺是你最大的依靠。凭借真本事，走遍天下都不怕。"
},
{
"id": 79,
"title": "第七十九签",
"type": "中平签",
"poem": "虚空许愿保平安，保得平安愿不还。\n莫道天高君远行，眼前便是神明理。",
"interpretation": "朋友，吕祖爷在说许愿与还愿的道理。虚空许愿求得平安，但平安后却不还愿。莫说天高皇帝远，眼前就有神明鉴察。这是在提醒要诚信守诺。",
"advice": "许下的承诺一定要兑现，不要失信于人。举头三尺有神明，做人要诚实守信。平安时要记得感恩，履行当初的诺言。"
},
{
"id": 80,
"title": "第八十签",
"type": "上上签",
"poem": "直上仙岩要学仙，此知一旦帝王宣。\n青天白日常明照，心正忠义寿万年。",
"interpretation": "朋友，大吉大利！这支签说直上仙岩学仙道，有朝一日得帝王宣召。青天白日般光明正大，心正忠义就能福寿万年。",
"advice": "坚持正道修行，终会得到重用。保持心地光明，忠义待人。这样的品格不仅能成就事业，还能获得长久的福报。"
},{
"id": 81,
"title": "第八十一签",
"type": "上上签",
"poem": "道大能成得自然，皇天瑞气蔼山川。\n君子可宜终吉庆，荣华富贵享天年。",
"interpretation": "朋友，这可是支福泽深厚的大吉之签！吕祖爷说只要你遵循大道、顺其自然，连皇天的祥瑞之气都会笼罩山川来护佑你。你这样的君子理应获得最终的美满吉祥，不仅能享受荣华富贵，更能安享天年之福。这不仅是眼前的顺利，更是一生的福报积累。",
"advice": "继续保持你的君子之风，依道而行，不必强求。你的福气正在自然汇聚，未来的道路会越走越宽广。安心享受这份天赐的福泽，同时记得把这份好运分享给身边的人。"
},
{
"id": 82,
"title": "第八十二签",
"type": "中平签",
"poem": "孤舟欲过岸，浪急渡人稀。\n女子牵衣笑，深藏祸与机。",
"interpretation": "朋友，这支签描绘了一个需要谨慎行事的场景。你现在就像那艘想要靠岸的孤舟，面对着急流险滩，能帮你的人确实不多。更要留意的是，那个看似友善、牵衣微笑的女子（可能指某种诱惑或表象），其实深藏着祸患与心机。吕祖爷这是在提醒你，越是困难的时候，越要保持清醒的头脑。",
"advice": "当前处境确实有些孤立无援，但切勿病急乱投医。要特别警惕那些突如其来的“好意”和表面热情的人。稳扎稳打，宁可慢一些，也要确保安全。看清本质，才能避开陷阱。"
},
{
"id": 83,
"title": "第八十三签",
"type": "下下签",
"poem": "恶瘴横空蔽日昏，群魔扰扰乱乾坤。\n若非一点灵光在，几丧残生泪暗吞。",
"interpretation": "朋友，抽到这支签，我知道你心里可能会咯噔一下。但请先稳住心神！吕祖爷描绘的这幅险恶景象，并不是在预言你的未来，而是在精准地映照出你此刻可能正面临的内心困境——那些像‘恶瘴’和‘群魔’一样的负面情绪、外界压力或混乱局面，几乎让你看不到光亮。然而，他着重强调的是，你内心深处的那‘一点灵光’——也就是你的良知、智慧和坚韧——一直都在，正是它保护着你没有被彻底击垮！",
"advice": "现在最需要的不是向外对抗，而是向内守护。紧紧守护住你心里那点不灭的‘灵光’——也就是你的是非观、你的希望和你的清醒。减少与外界的负面纠缠，给自己一个安静的空间来重新积聚力量。请相信，阴霾只是暂时的，你的灵光足以指引你走出困境。"
},
{
"id": 84,
"title": "第八十四签",
"type": "上上签",
"poem": "金乌浴海晓光新，丹凤衔书出玉宸。\n万国车书归一统，太平天子福黎民。",
"interpretation": "朋友，恭喜你！这是支寓意万象更新、天下一统的上上签！吕祖爷用‘金乌浴海’描绘了朝阳初升、光明重现的壮丽景象，又用‘丹凤衔书’预示了来自高层或核心的喜讯与认可。这预示着一种混乱结束、秩序重建、和谐统一的大好局面，不仅是个人运势的腾飞，更是能惠及众人的大福气。",
"advice": "一个全新的、充满希望的周期正在开始。积极迎接和顺应这种大势所趋的变化。你很可能在其中扮演连接或服务的角色，从而获得极大的认可与福报。这是利己利人的大好时机。"
},
{
"id": 85,
"title": "第八十五签",
"type": "中平签",
"poem": "云散月当空，牛前马后逢。\n张弓方抵御，一箭定全功。",
"interpretation": "朋友，这支签揭示了一个由暗转明、把握时机的过程。‘云散月空’说明之前的迷茫和阻碍即将消散，真相和机会就要显现。‘牛前马后’暗示机遇就在眼前，需要你精准地把握时机。最后‘一箭定功’则告诉你，成功的关键在于看准目标后，那果断而精准的一击。",
"advice": "耐心等待迷雾完全散去，不要急于行动。当时机清晰地出现在你面前时（可能在春秋时节，或特定时机），务必集中你全部的精力和资源，果断出手。这一次的关键在于精准，而不在于次数。"
},
{
"id": 86,
"title": "第八十六签",
"type": "下下签",
"poem": "天崩地裂岂能医，九死一生命若丝。\n更有亲人招厄运，此时君尔莫迟疑。",
"interpretation": "朋友，这支签听起来确实惊心动魄，但请千万别被字面意思吓倒！吕祖爷用如此强烈的比喻，是想让你高度重视当前面临的、看似无法挽回的困境或危机，它可能确实波及到了你的亲人。‘命若丝’不是在说生命终结，而是在强调情况的危急，需要你立刻警觉起来。他喊出‘莫迟疑’，正是在给你最关键的提醒和行动的勇气！",
"advice": "现在已经不是犹豫或慢慢商量的时候了。必须当机立断，采取最果断、最有效的措施来应对危机，尤其是要保护好家人。寻求专业的帮助或借助外部的力量至关重要。这是考验你决断力和担当的时刻，行动起来！"
},
{
"id": 87,
"title": "第八十七签",
"type": "上上签",
"poem": "春来花发满皇州，牡色红英照碧流。\n君尔今年逢百福，求财求利任君谋。",
"interpretation": "朋友，这可是支充满生机与繁荣的顶级上上签！吕祖爷为你描绘了一幅帝都春天、百花争艳、红映绿水的盛世美景，这正是你当下运势的写照——充满了蓬勃的生机与无限的希望。他明确告诉你，今年就是你广纳百福的年份，无论是求财富还是谋利益，你都可以大胆地去规划、去争取，运势会为你加持。",
"advice": "不要辜负这大好的春光和运势！积极主动地去开拓财源，实施你的生利计划。你的任何合理谋划在此刻都更容易成功。放开手脚，把握住这个丰收之年。"
},
{
"id": 88,
"title": "第八十八签",
"type": "中平签",
"poem": "水中捉月费工夫，费尽工夫却又无。\n莫信闲言并浪语，枉教身在洞庭湖。",
"interpretation": "朋友，吕祖爷用‘水中捞月’这个生动的比喻，是在点醒你目前可能正执着于一个根本不可能实现的目标，或者轻信了一些不靠谱的消息。你付出了很多心血，但结果注定是一场空，就像身在广阔的洞庭湖，却迷失了方向。他心疼你的付出，所以特意来提醒你。",
"advice": "是时候清醒地评估一下你当前努力的方向了。如果发现目标如水中月一样虚幻，就要勇敢地及时止损。不要再被周围的闲言碎语所误导，脚踏实地，重新寻找真实可行的目标。"
},
{
"id": 89,
"title": "第八十九签",
"type": "下下签",
"poem": "野鬼张弧射主人，暗中谋害事难陈。\n只因接物多乖戾，到底终须有祸迍。",
"interpretation": "朋友，这支签指出了小人暗算的危机，读起来确实让人心生警惕。吕祖爷说有如‘野鬼’般的小人在暗中放冷箭，意图伤害你，而且这种阴谋陷害一时难以说清。但他更深刻地指出了内因——部分原因也在于你平时待人接物可能有些乖张偏激，留下了隐患。这是在提醒你外防小人，内省己身。",
"advice": "近期务必谨言慎行，提防暗中的算计，重要事情要留证据。同时，深刻反思自己与人相处的方式，是否有不当之处，并加以调整。消除内在的戾气，才能从根本上化解外部的祸患。"
},
{
"id": 90,
"title": "第九十签",
"type": "上上签",
"poem": "崆峒城里事如麻，无事如君有几家。\n但依本分终安逸，笑看红尘镜里花。",
"interpretation": "朋友，这支签蕴含着一份超然的智慧。吕祖爷说世间万事纷扰复杂如乱麻，但像你这样能保持内心清净、无事挂怀的人真是难得。他赞许你懂得安守本分，所以能获得最终的安逸，并能像看镜中花一样，笑看红尘俗世的纷扰。这是一种很高的境界。",
"advice": "继续保持你这份难得的清醒和淡然，不必卷入外界的纷争与忙碌。坚守自己的本心和原则，过好简单真实的生活。这种‘无事’的状态，本身就是最大的福气，请好好享受这份安宁。"
},
{
"id": 91,
"title": "第九十一签",
"type": "中平签",
"poem": "檐前鹊噪正翩翩，君尔何须问圣贤。\n动静凶衰宜止止，荣枯得失总由天。",
"interpretation": "朋友，吕祖爷听到檐前喜鹊欢叫，知道你心里正为某事忐忑，想来问个吉凶。他慈祥地告诉你，不必过于焦虑地追问神明，事情的动静、凶吉、荣枯、得失，自有天道的安排。这是在宽慰你放下过度掌控的心，学会顺应自然。",
"advice": "保持观察，但不必过度解读征兆或急于寻求答案。对于正在进行的事情，如果感觉不安，不妨先暂停下来。学习以平常心接受成败得失，相信老天自有最好的安排。"
},
{
"id": 92,
"title": "第九十二签",
"type": "下下签",
"poem": "韩彭战罢血玄黄，鸟尽弓藏大可伤。\n睡觉五更皆梦寐，何如高卧白云乡。",
"interpretation": "朋友，这支签借用韩信彭越的典故，道出了兔死狗烹的悲凉，读来令人唏嘘。吕祖爷描绘了功成之后遭遇不公的惨状，指出这是古今皆有的憾事。他由此引导你思考：与其在功名利禄的战场上拼杀到最后却落得如此下场，何不早点超脱出来，高卧在白云乡间，享受自在呢？",
"advice": "如果你正身处激烈的竞争或权力的中心，需要开始为长远做打算，思考急流勇退的智慧。追求心灵的宁静和生活的闲适，或许比追逐世俗的极致成功更能获得真正的安稳与快乐。"
},
{
"id": 93,
"title": "第九十三签",
"type": "上上签",
"poem": "春来雨露滋兰蕙，桂子秋香满玉除。\n正好人生行乐耳，莫教辜负锦年华。",
"interpretation": "朋友，这是支充满诗意和生命喜悦的上上签！吕祖爷说你的运势如春雨滋润兰蕙般温润滋养，到了秋天则像桂香飘满玉阶一样硕果累累、声誉远扬。他鼓励你，人生正该在这样的顺境中及时行乐，千万不要辜负了这锦绣般的美好年华。",
"advice": "好好享受当前阶段的顺利与滋养，同时为秋天的收获打下基础。在工作之余，一定要懂得安排时间与家人朋友共度欢乐时光。活在当下，珍惜眼前的美好，这才是对生命最好的礼赞。"
},
{
"id": 94,
"title": "第九十四签",
"type": "中平签",
"poem": "梦中得宝醒来无，应效巫山一片图。\n若问终身荣辱事，前途终是莫踌躇。",
"interpretation": "朋友，这支签在探讨理想与现实的差距。吕祖爷说梦中得宝醒来成空，告诉你有些美好的愿景可能如巫山云雨般，虽美却难以把握、不够真实。但当你问及终身荣辱时，他鼓励你：前途终究需要你自己去开创，不必在此犹豫不前。",
"advice": "放下那些不切实际的幻想，认清现实。然而，不要因为理想的虚幻就对未来产生怀疑。停止徘徊，勇敢地朝着你认准的方向迈出坚实的步伐，真实的成功需要靠行动去创造。"
},
{
"id": 95,
"title": "第九十五签",
"type": "下下签",
"poem": "病患时时命蹇衰，何须打瓦钻龟儿。\n真宗修德禳灾星，方保安全度岁期。",
"interpretation": "朋友，这支签直言不讳地指出了你当前可能面临的健康困扰或运势低迷。吕祖爷说，当疾病缠身、时运不济的时候，不必去搞那些打瓦钻龟的迷信占卜（意指无效的方法）。他给出了根本的解决之道——要像宋真宗那样，通过修养真实的德行来化解灾星，这样才能安全度过难关。",
"advice": "如果身体不适，务必寻求正规医疗，同时注重养生。更重要的是，要反思并提升自己的道德修养，多行善事。内在的正气是最好的护身符，能帮你抵御外在的厄运。"
},
{
"id": 96,
"title": "第九十六签",
"type": "上上签",
"poem": "巍巍宝塔不寻常，八面玲珑尽放光。\n劝君志气休自挫，紫袍金带甚相当。",
"interpretation": "朋友，这可是支气势非凡的上上签！吕祖爷将你比作一座巍峨不凡、八面玲珑的宝塔，周身都在绽放光芒。他鼓励你，千万不要自我怀疑、挫了志气，你完全有能力匹配‘紫袍金带’那样的高位显爵，成就一番大事业。",
"advice": "充分认识并相信自己的卓越潜力与独特价值。保持自信，你的才能如宝塔般耀眼。朝着更高的目标勇敢迈进，你注定要身居要职，承担重任。"
},
{
"id": 97,
"title": "第九十七签",
"type": "中平签",
"poem": "园林月色摇疏影，恍若铺琼满地金。\n忽被晓风吹叶乱，至今颠倒乱人心。",
"interpretation": "朋友，这支签用诗意的画面描绘了心境的变幻。吕祖爷说之前的生活如园林月色、疏影摇曳，宁静美好得像铺满了琼玉黄金。但忽然一阵晓风吹来，枝叶零乱，美景被打碎，至今让你的心绪纷乱不安。他理解你这份从静到乱的无措。",
"advice": "接受生活与心境的变化是常态，美好的状态不会永恒。当外界的‘风’吹乱你的心时，试着去观察这份‘乱’，而不被它完全卷入。慢慢整理，恢复内心的秩序，不必强求立刻回到从前。"
},
{
"id": 98,
"title": "第九十八签",
"type": "下下签",
"poem": "出入求谋事宜迟，只恐闲人惹是非。\n明珠夜照狐妖现，莫待胡为后悔迟。",
"interpretation": "朋友，这支签发出了明确的预警信号。吕祖爷告诉你，近期所有外出、求人、谋事的行为都宜放缓推迟，因为很可能有小人（闲人）会给你惹上是非。他更用‘明珠照妖’的比喻，提醒你身边可能潜伏着如狐妖般伪善的坏人，在你放松警惕时现形。这是在急切地提醒你防范未然！",
"advice": "近期尽量保持低调，推迟重要的对外活动和决策。擦亮眼睛，仔细辨别身边的人，尤其要警惕那些巧言令色者。凡事三思而后行，切勿冲动，以免日后追悔莫及。"
},
{
"id": 99,
"title": "第九十九签",
"type": "上上签",
"poem": "贵人遭遇水云乡，冷淡交情滋味长。\n黄阁开时延故客，骅骝应得骤康庄。",
"interpretation": "朋友，这是支关于贵人与长远发展的上上签！吕祖爷说你会在一处清幽之地（水云乡）遇到贵人，起初交往可能看似平淡，但这份情谊的滋味却深远悠长。当贵人的府邸（黄阁）敞开招待你这故客时，你就能像骏马（骅骝）一样在康庄大道上奔驰，前程似锦。",
"advice": "留意在清静场合或通过雅事结识的朋友，他们可能就是你的贵人。不急于求成，用心经营这份看似平淡的关系。当时机成熟，这位贵人会为你打开通往广阔天地的道路。"
},
{
"id": 100,
"title": "第一百签",
"type": "上上签",
"poem": "我本天仙雷雨师，吉凶祸福我先知。\n至诚祷告皆灵应，抽得终签百事宜。",
"interpretation": "朋友，功德圆满！你抽中了这具有特殊意义的第一百签！吕祖爷在此亲自显化，表明他作为雷雨师、知晓吉凶祸福的身份。他承诺，只要至诚祷告，必有灵验。而这支终签本身，就预示着你所问的百种事情都将顺利、圆满，为你这一轮的求签画上了一个最吉祥的句号。",
"advice": "怀着至诚感恩的心，回顾并整合这一轮求签带给你的所有启示与智慧。对你未来的所有计划和愿望都保持信心，大趋势已然吉祥。带着这份圆满的能量，积极地去创造你的生活吧！"
}
]